CSI API ETABS v1

# cSapModelDesignCompositeBeam Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignCompositeBeam DesignCompositeBeam { get; }

    ReadOnly Property DesignCompositeBeam As cDesignCompositeBeam
    	Get

    Dim instance As cSapModel
    Dim value As cDesignCompositeBeam

    value = instance.DesignCompositeBeam

    property cDesignCompositeBeam^ DesignCompositeBeam {
    	cDesignCompositeBeam^ get ();
    }

    abstract DesignCompositeBeam : cDesignCompositeBeam with get

#### Property Value

Type: cDesignCompositeBeam

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com